consent-management/consent-management-lib/src/test/resources/json/service/mapper/pis-common-payment-data.json

{
  "instanceId": "UNDEFINED",
  "id": "123",
  "paymentId": "329d04d9-cb42-4fb5-8265-de58fa00366d",
  "paymentType": "payments",
  "paymentProduct": "sepa-credit-transfers",
  "transactionStatus": "RCVD",
  "payment": "c29tZSBwYXltZW50IGNvbnRlbnQ=",
  "psuDataList": [
    {
      "psuId": "PSU ID",
      "psuIdType": "PSU ID TYPE",
      "psuCorporateId": "PSU CORPORATE ID",
      "psuCorporateIdType": "PSU CORPORATE ID TYPE",
      "psuIpAddress": "PSU IP ADDRESS"
    }
  ],
  "tppInfo": {
    "authorisationNumber": "12345987",
    "tppName": "Tpp company",
    "tppRoles": [
      "PISP"
    ],
    "authorityId": "authority id",
    "authorityName": "authority name",
    "country": "Germany",
    "organisation": "Organisation",
    "organisationUnit": "Organisation unit",
    "city": "Nuremberg",
    "state": "Bayern"
  },
  "payments": [
    {
      "instanceId": "UNDEFINED",
      "paymentId": "cea9dda3-5154-420d-b1a7-6b4798fccb4b",
      "endToEndIdentification": "RI-123456789",
      "currency": "EUR",
      "amount": 1000.00,
      "creditorAgent": "BCENECEQ",
      "creditorName": "Telekom",
      "creditorAddress": {
        "street": "WBG Straße",
        "buildingNumber": "56",
        "city": "Nürnberg",
        "postalCode": "90543",
        "country": "DE"
      },
      "purposeCode": "",
      "remittanceInformationUnstructured": "Ref. Number TELEKOM-1222"
    }
  ],
  "creationTimestamp": "2019-08-22T11:00:00Z",
  "multilevelScaRequired": false,
  "aspspAccountId": "some account id",
  "statusChangeTimestamp": "2019-08-22T11:01:27Z",
  "authorisationTemplate": {},
  "signingBasketBlocked": true
}
