consent-management/consent-management-lib/src/test/resources/json/service/mapper/pis-common-payment-response.json

{
  "payments": [
    {
      "paymentId": "cea9dda3-5154-420d-b1a7-6b4798fccb4b",
      "endToEndIdentification": "RI-123456789",
      "currency": "EUR",
      "amount": 1000.00,
      "creditorAgent": "BCENECEQ",
      "creditorName": "Telekom",
      "creditorAddress": {
        "streetName": "WBG Straße",
        "buildingNumber": "56",
        "townName": "Nürnberg",
        "postCode": "90543",
        "country": "DE"
      },
      "purposeCode": "",
      "remittanceInformationUnstructured": "Ref. Number TELEKOM-1222",
      "psuDataList": [
        {
          "psuId": "PSU ID",
          "psuIdType": "PSU ID TYPE",
          "psuCorporateId": "PSU CORPORATE ID",
          "psuCorporateIdType": "PSU CORPORATE ID TYPE",
          "psuIpAddress": "PSU IP ADDRESS"
        }
      ],
      "creationTimestamp": "2019-08-22T11:00:00Z"
    }
  ],
  "paymentProduct": "sepa-credit-transfers",
  "paymentType": "payments",
  "tppInfo": {
    "authorisationNumber": "12345987",
    "tppName": "Tpp company",
    "tppRoles": [
      "PISP"
    ],
    "authorityId": "authority id",
    "authorityName": "authority name",
    "country": "Germany",
    "organisation": "Organisation",
    "organisationUnit": "Organisation unit",
    "city": "Nuremberg",
    "state": "Bayern"
  },
  "externalId": "329d04d9-cb42-4fb5-8265-de58fa00366d",
  "psuData": [
    {
      "psuId": "PSU ID",
      "psuIdType": "PSU ID TYPE",
      "psuCorporateId": "PSU CORPORATE ID",
      "psuCorporateIdType": "PSU CORPORATE ID TYPE",
      "psuIpAddress": "PSU IP ADDRESS"
    }
  ],
  "paymentData": "c29tZSBwYXltZW50IGNvbnRlbnQ=",
  "transactionStatus": "RCVD",
  "statusChangeTimestamp": "2019-08-22T11:01:27Z",
  "creationTimestamp": "2019-08-22T11:00:00Z",
  "authorisations": [
    {
      "authorisationId": "5e89f573-800e-4158-bb9c-c7fcc9c701d9",
      "psuIdData": {
        "psuId": "PSU id"
      },
      "parentId": "parent id",
      "scaStatus": "received",
      "authenticationMethodId": "method id",
      "scaAuthenticationData": "authentication data",
      "chosenScaApproach": "REDIRECT",
      "authorisationType": "CONSENT"
    }
  ],
  "instanceId": "UNDEFINED",
  "signingBasketBlocked": true
}
